/*
Создайте класс Person
Напишите в нем поля (атрибуты), описывающие характеристики человека: пол, имя, рост, вес, возраст
Проинициализируйте их какими-то значениями
Создайте в классе методы, описывающие поведение (что он может делать) человека: идти, сидеть, бежать, говорить, учить Java
 */

public class Person {
    boolean male = true;
    String name = "Serj";
    float height = 184.0f;
    float weight = 94.5f;
    int age = 33;

    go() {

    }

    sit() {

    }

    run() {

    }

    talk() {

    }

    learnJava() {

    }
}